USE test;
DROP TABLE IF EXISTS book;

CREATE TABLE `book` 
(
	`id` INT(11) NOT NULL AUTO_INCREMENT,
	`title` VARCHAR(100) NOT NULL,
	`description` VARCHAR(100) NOT NULL,
	`author` VARCHAR(100) NOT NULL,
	`isbn` VARCHAR(20) NOT NULL,
	`printYear` INT(4) NOT NULL DEFAULT '0',
	`readedAlready` BIT(1) NOT NULL DEFAULT b'0',
	PRIMARY KEY (`id`)
)
COLLATE='utf8_general_ci';


INSERT INTO `book` (`title`,`description`,`author`,`isbn`,`printYear`) VALUES 
("Война и мир","Самый большой роман школьной программы","Лев Толстой","978-5-699-08860-7", "1867"),
("Шерлок Холмс","Сборник рассказов. ","А. Конан Дойль","978-5-17-087119-3", "1887"),
("Горе от ума","Комедия в стихах.","А. Грибоедов","978-5-08-005537-9", "1831"),
("Ревизор","Комедия в пяти действиях.","Н. Гоголь","5-08-004037-8", "1836"),
("В мире животных","Детская литература.","К. Петров","7-04-066037-2", "1994"),
("Терминатор 1","Книга по фильму.","неизвестен","5699187650", "2006"),
("Терминатор 2","Книга по фильму.","неизвестен","5699187651", "2006"),
("Терминатор 3","Книга по фильму.","неизвестен","5699187653", "2006"),
("Терминатор 4","Книга по фильму.","неизвестен","5699187654", "2006"),
("Терминатор 5","Книга по фильму.","неизвестен","5699187655", "2006"),
("Терминатор 7","Книга по фильму.","неизвестен","5699187656", "2006"),
("Терминатор 10","Книга по фильму.","неизвестен","5699187657", "2006"),
("Эликсир","Сказки","Донцова","978-5-699-91407-4", "2017"),
("Голое платье звезды","Проза","Донцова","978-5-699-97229-6", "2016"),
("Thinking in Java","new edition","B. Eckel","978-0131872486", "2006"),
("Java Reflection in Action ","for developers","Ira R. Forman and Nate Forman ","9781932394184", "2004"),
("Сказки","пять сказок Пушкина","Пушкин","978-5-373-03958-1", "2015"),
("Басни","басни","Крылов","978-5-699-80696-6", "2015"),
("Басни2","басни","Крылов","978-5-699-80696-6", "2015"),
("Басни3","басни","Крылов","978-5-699-80696-5", "2013"),
("Басни4","басни","Крылов","978-5-699-80696-2", "2043"),
("Очередной мемуар","Проза","Донцова","978-5-712-97276-0", "2032");